app/workers/daily_record_worker.rb

INSERT INTO "daily_records" ("date", "male_count", "female_count", "male_avg_age", "female_avg_age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def perform
    day = Date.yesterday
    users = User.where(created_at: day.all_day)
    male_count = HourlyRecord.count('male')
    female_count = HourlyRecord.count('female')
    male_avg_age = users.avg_age('male')
    female_avg_age = users.avg_age('female')

    daily_record = DailyRecord.new(
                    date: day,
                    male_count: male_count,
                    female_count: female_count,
                    male_avg_age: male_avg_age,
                    female_avg_age: female_avg_age
                    )
    if daily_record.save