app/workers/user_worker.rb

  def perform
    url = 'https://randomuser.me/api/?results=20'
    resp = Net::HTTP.get_response(URI.parse(url))
    data = JSON.parse(resp.body)
    data['results'].each do |api_user|
      user = User.find_or_initialize_by(
              uuid: api_user.dig('login', 'uuid'),
              gender: api_user['gender'],
              name: api_user['name'],
              age: api_user.dig('dob', 'age')
            )
---
SELECT "users".* FROM "users" WHERE "users"."uuid" = $1 AND "users"."gender" = $2 AND "users"."name" = $3 AND "users"."age" = $4 LIMIT $5  [["uuid", "810b9b2b-b698-4b6c-8e11-1a63a351e501"], ["gender", "female"], ["name", "{\"title\":\"Mademoiselle\",\"first\":\"Leonie\",\"last\":\"Brun\"}"], ["age", 56], ["LIMIT", 1]]