app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
SELECT "daily_records".* FROM "daily_records"
---
  def index
    users = params[:query].blank? ? User.all : User.where("full_name iLIKE ?", "%#{params[:query]}%")
    @users = users.paginate(page: params[:page], per_page: 15)
    @daily_record = DailyRecord.all