app/models/user.rb

SELECT AVG("users"."age") FROM "users" WHERE "users"."created_at" BETWEEN $1 AND $2 AND "users"."gender" = $3  [["created_at", "2024-01-25 00:00:00"], ["created_at", "2024-01-25 23:59:59.999999"], ["gender", "male"]]
---
  scope :avg_age, ->(gender) { where(gender: gender).average(:age).to_f.round(2) }